const {
	factShema,
	factSecondarySchema
} = require('../models/facts');
const {getRandomByLength} = require('../../lib/utils');

function getFacts(options = {}) {
	return factShema.find(options);
}

function getFactsSecondary(options = {}) {
	return factSecondarySchema.find(options);
}

function insertSecondaries(ids) {
	const payload = ids.map(id => ({refId: id}));

	return factSecondarySchema.insertMany(payload);
}

function insertFacts() {
	const payload = [
		{
			source: 'Clashes, Air Combat over North Vietnam, page 9',
			text: [
				'1965, 2 марта (Первый день Rolling Thunder’a)',
				'Мигами отбита без потерь атака на мост самолетами A-4 и F-8. Один F-8 поврежден, миги без потерь',
				'На следующий день, звено из 4 F-105 с 8 бомбами Mark 117 (750 pounds) и ПТБ прибыли к тому же мосту на высоте 15к (4,5 км) и начали кружить вокруг него со скоростью 325 узлов (600 км/ч), ожидая разрешения, был легкий туман с видимостью 1,5к футов (450 метров). тандерчиф1 и тандерчиф2 был атакован двумя пикирующими МиГ-17, после атаки ушедшими в туман. В момент, когда первая пара мигов открыла огонь, вторая спикировала на тандерчиф3 и тандерчиф4, но была замечена и встречена маневром в сторону мигов, которые прошли мимо, также скрывшись в тумане. В следущий момент тандерчиф3 и тандерчиф4 были атакованы сзади предположительно первой парой мигов. Все F-105 были подбиты, только двое дотянули до базы'
			],
			image: 'https://imgur.com/Dl0bnxy'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 20',
			text: [
				'В 1966 году американцами считалось:\nчто МиГ-21 будет иметь 3:1 коэффициент против F-4 и 4:1 против F-105\nФантом будет иметь коэффициент против МиГ-17 18:1\nМиг-17 1:1 с тандерчифом'
			]
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 27',
			text: [
				'По рекомендации военных США самолеты всегда должны были сбрасывать ПТБ, если атакованы ЗРК, или мигами. Однако, зачастую, при больших скоростях и маневрах был риск повредить самолет, из-за чего приходилось во время атаки выдерживать режимы, чтобы безопасно сбросить баки. Таким образом, терялись драгоценные секунды и маневр на уход из под атаки не мог быть выполнен сразу, что также негативно влияло на живучесть'
			],
			image: 'https://imgur.com/dRsW9Wh'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 28',
			text: [
				'Экипажи USAF, в особенности F-105, были натренированы для атак на предельно малых высотах. Считалось, что самолёт, летящий на малой высоте, будет лучшим средством для достижения внезапности и прорыва ПВО, а высокая скорость сделает его неуязвимым от огня с земли. К тому же, точность бомбометания на малых высотах была существенно выше.',
				'Опыт Вьетнама показал ошибочность такой тактики. На малых высотах самолёт был уязвим ко всему, а улучшение систем раннего предупреждения вовсе свёло на нет любой эффект неожиданности. Из-за тяжёлых потерь в середине 1965 года от атак на предельно малых отказались полностью, экипажи тандерчифов стали летать высоко и потери снизились.'
			],
			image: 'https://imgur.com/fvJ4QtZ'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 32',
			text: [
				'В июне 1965 разведка обнаружила развертывание SA-2 (С-75) установок, но атаковать их запретили, в виду того, что там мог находиться (и находился) советский персонал.',
				'Уже 24 июля звено из четырёх F-4 было атаковано одной установкой. Ракета прямым попаданием поразила один из бортов и повредила осколками три остальных. Сразу же был дан приказ атаковать ЗРК, однако когда ударные группы в количестве 46 самолетов F-105 добрались до цели, их встретили сильным ААА огнем. 6 самолетов было уничтожено сразу на подлете, атака провалилась. SA-2 установки были заранее перемещены, а вместо них установлены зенитные орудия, эту тактику Вьетнам будет использовать до конца войны'
			],
			image: 'https://imgur.com/UvWYWLD'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 50',
			text: [
				'В мае 1966 пустили слух, что Северные Вьетнамцы могут опрашивать американские RWR передатчики. Если это была правда, то минимальная высота SA-2 с 3к футов доходила до 1к (300 метров). Из-за этого многие летчики боялись включать передатчик'
			]
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 53',
			text: [
				'Июль 1966. Звено из четырех самолетов F-8 провело бой, выпустив восемь AIM-9, только одна ракета попала. У трех из четырех самолетов заклинили пушки Colt Mk 12. Эта пушка так и останется самой проблемной до конца войны'
			],
			image: 'https://imgur.com/OC7YjqH'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 83',
			text: [
				'У МиГ-17 была очень малая нагрузка на крыло, на скорости до 740 км/ч он свободно перекручивал F-4 и F-8, став самым маневренным самолетом над небом Вьетнама. МиГ-21 имел также малую нагрузку, а на больших высотах (4500 и более метров) превосходил все американские самолеты; на высотах ниже был примерно равен F-4 и F-8 и на любой из высот был лучше F-105. Кроме того, МиГ-21 имел самый хороший коэффициент тяги к весу и мог легко уходить из атаки.',
				'Например, экипажам тандерчифов была дана инструкция сразу уходить, если МиГ-21 атакует'
			],
			image: 'https://imgur.com/q9hQVsP'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 139',
			text: [
				'USAF несли большие потери от МиГов, отчасти из-за того, что им приходилось действовать с аэродрома в Тайланде и потом еще дозаправляться над Лаосом. Это давало вьетнамским GCI достаточно времени для перехвата и наведения МиГ-21.',
				'Иначе дела обстояли у морячков. Благодаря тому, что авианосцы находились близко к берегу, дозаправка самолетам часто не требовалась, что сокращало окно реагирования для вьетнамских служб.',
				'Кроме того, нередко самолеты морячков летали низко у воды, затрудняя обнаружение.\nФишбедов просто не успевали навести, отчего основным противником для Navy стали патрули МиГ-17.',
				'За всю операцию Rolling Thunder морячки сбили всего четыре МиГ-21, что составляло около 13% от всех их побед, потеряв МиГам три самолета.',
				'USAF за операцию сбили 21 фишбед, что составило 27% от общего числа побед, потеряв фишбедам 23 самолета.'
			]
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 162',
			text: [
				'Американские летчики завидовали эффективным GCI службам и маневренным самолетам противника, часто говоря, что будь у них такие средства, они бы быстро стали асами. А вот о летчиках они отзывались плохо, характеризуя их как неуверенных и неумелых в бою и маневрах. К сентябрю 1967 года подготовка начала улучшаться, но незначительно. За операцию Rolling Thunder известен всего один случай, когда северовьетнамский летчик ушел из под атак грамотными маневрами, уничтожив преследователей.',
				'Согласно советским источникам, вьетнамцы с большим трудом пилотировали самолеты, управление и кабины которых были созданы преимущественно для европейского телосложения, и зачастую им не хватало физической силы, чтобы совершать агрессивные маневры. Кроме того, нередки были случаи, когда в следствии традиционно скудного рациона, вьетнамцы теряли сознание на перегрузках, не приходя в себя, что также было отмечено американцами, в докладах которых говорилось, что из ряда маневров МиГи просто не выходили и врезались в землю.'
			],
			image: 'https://imgur.com/s2hzoqv'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 173',
			text: [
				'Вьетнамцы полагались на GCI, прикрывающий их со всех сторон, поэтому основной фокус в построениях был на атаку.',
				'Существовало три основных типа построения звена:',
				'Hi-Lo Pairs (МиГ-17, МиГ-21)\n* high pair (ведущая): высота 2км \n* low pair (на удалении 1.5км): высота 500м\n* МиГ-21 летали одиночными бортами – Hi-Lo Singles\nпервая пара атакует и начинает уклоняться, пока вторая пара продолжает атаку. как правило, US истребители не успевали заметить вторую пару, что позволяло ей подойти незаметно',
				'Stacked Three (МиГ-17)\n* ведущий: высота 3км\n* второй: высота 2.5км, удаление 1.5км\n* третий: высота 1км, удалением 1.5км от второго\nведущий атаковал первым, провоцируя врага на уклонение (уход вниз), далее второй спускался и продолжал атаку, а третий добивал уже в самом низу',
				'Свободная охота (МиГ-21)\n* только опытные летчики\n* выключали IFF передатчик и искали цели в районе'
			],
			image: 'https://imgur.com/siCIRKh'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 188',
			text: [
				'В 1970 году после окончания Rolling Thunder Северному Вьетнаму начали поступать МиГ-19. В Пакистане US смогли опробовать эти самолеты и провести исследования, получив следующие результаты:',
				'* нагрузка на крыло была выше, чем у МиГ-17, но сильно меньше, чем у F-4 (51 против 81)\n* имелись боевые закрылки, отклоняющиеся на 15 градусов, позволяющие лучше маневрировать на скорости ниже 460 узлов\n* на скорости до 1.2 маха ускорялся лучше F-4, имел высокий ТВР (.84 против .79 фантома)\n* макс скорость 1.6 маха\n* отличный обзор\n* единственна проблема – низкая дальность. один из американских испытателей комментировал, что за 5 минут форсажа самолет сжигает почти все топливо'
			],
			image: 'https://imgur.com/lLWsyIi'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 192',
			text: [
				'Нередко USAF теряли фантомы из-за Adverse Yaw (поворачивает/скользит в противоположную сторону крена), пытаясь увернуться от SA-2'
			],
			image: 'https://imgur.com/DzzUmRH'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 209',
			text: [
				'8 мая 1972 года фантомы поддерживали ударную группу над Ханои. Звено F-4 получило вектор на противника. Первая пара успешно отстрелялась, поразив один миг, второй ушел. Вторая пара вышла еще на двух мигов, которые отступали. Ведущий той пары фантомов, вспоминая рассказывал, – «Вышел на ведомого противника. AIM-4D были уже выбраны и подано охлаждение. Пустил сразу обе. Даже близко к мигу они не подлетели. Однако не унывал, было еще две AIM-7. Пустил, – обе промазали. Дистанция до мига сократилась до 700 футов. Нет ни ракет, ни пушки. Две минуты шел за ним, думая, что можно сделать...»',
				'Летчику, привыкшему летать fluid four строй, даже в голову не пришло разрешить ведомому, имевшему полный боевой подвес, открыть огонь, пока миг не скрылся'
			],
			image: 'https://imgur.com/eMGWUSr'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 209',
			text: [
				'Северовьетнамские расчеты C-75, набравшись опыта к 1972 году, заключили, что для максимального шанса поражения цели оптимально использовать три ракеты. Работало это следующим образом:\nСогласно рекомендациям, американские летчики, в случае по ним пуска ЗРК, предпринимали маневр уклонения после сброса баков, – пикировали и у земли резко давали на себя. Основываясь на этом, первая ракета пускалась высоко по цели, вынуждая летчика уйти вниз. Через несколько секунд пускалась вторая низко по цели, а третья, спустя еще несколько секунд, – ровно по цели. Таким образом, летчик кабрированием выходил на последнюю ракету.'
			],
			image: 'https://imgur.com/K4iZnsj'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 234',
			text: [
				'В мае 1972 Северному Вьетнаму начали поступать новые модификации МиГ-19 и МиГ-21, которые, согласно разведке, были быстрее и маневреннее. В тот же месяц впервые было замечено использование ракет Atoll с бортов МиГ-17 и МиГ-19. Кроме того, появился доклад, в котором говорилось о МиГ-21, уничтожившем F-4 пусками четырех ракет, что уже явно указывало, что на вооружение Вьетнаму начали поступать так называмые MiG-21J (согласно американской классификации), способные нести до четырех ракет «воздух-воздух»'
			],
			image: 'https://imgur.com/a/Z7jD4ry'
		},
		{
			source: 'Clashes, Air Combat over North Vietnam, page 238',
			text: [
				'«Kuban tactics». Одно из самых эффективных построений, которое использовали миги.\nПервая пара, как правило на МиГ-21, шла впереди на большой скорости.\nЗа ней на удалении 2-4 мили и с принижением 4000-6000 футов шла пара МиГ-19, управляемая GCI.\nМиГ-21 атаковали первыми и выходили из боя, а сразу за ними шли 19 на разбросанное звено. Такая тактика стоила американцам тяжелыми потерями.'
			],
			image: 'https://imgur.com/GQhr0Ke'
		}
	];
}

async function getRandomNotSeenFact() {
	const factsSecondary = await getFactsSecondary({isShown: false});
	const factsSecondaryLength = factsSecondary.length;

	// if factsSecondary.length
	// get random
	// and flag as seen
	if (factsSecondaryLength) {
		const randomFactSecondary = factsSecondary[getRandomByLength(factsSecondaryLength)];

		// async, doesn't matter if it updates later or before
		factSecondarySchema.findByIdAndUpdate(randomFactSecondary._id, {isShown: true})
			.then(item => console.log(item, 'found and updated'));

		return factShema.findById(randomFactSecondary.refId);
	}

	// if !factsSecondaryLength.length
	// get and update whole secondaries to {isShown: false}
	// then try again
	return factSecondarySchema.updateMany({isShown: true}, {isShown: false})
		.then(getRandomNotSeenFact)
		.catch(error => console.log('reset error >', error));
}

module.exports = {
	getFacts,
	getFactsSecondary,
	insertSecondaries,
	getRandomNotSeenFact
};
